In [3]:
import sqlite3,pandas as pd
database=sqlite3.connect('pandas.sqlite')

since there is no table exhisting previously therefore we need to create dataframe at first and then convert it into sql type

In [13]:
table={'Name':['Aditya','Ajay','Abhi'],'Age':[20,21,22]}
df=pd.DataFrame(table)
df

     Name  Age
0  Aditya   20
1    Ajay   21
2    Abhi   22

if we don't want to set index then

In [14]:
sql=df.to_sql('Student',database,if_exists='replace',index=False)

if we want to set index then at first we need to set index from our dataframe and then that index will be used in our sql table as index

In [15]:
df.set_index('Age',inplace=True)

In [16]:
df

       Name
Age
20   Aditya
21     Ajay
22     Abhi

In [11]:
sql=df.to_sql('Student',database,if_exists='replace',index=True)

now we will always make changes in the dataframe and in last we will convert that dataframe into sql and use if_exhist='replace' so if the same table will be previously exhisting then simply replace it the new table

if we want to fetch the data from sql table then

In [17]:
res=pd.read_sql_query('select * from Student',database)
res

     Name  Age
0  Aditya   20
1    Ajay   21
2    Abhi   22